import math

# Функція, яку інтегруємо
def f(x, a, b):
    return math.cos(2 * x) / (1 + a * x + b * x**3)

# Формула Сімпсона з кроком h=0.04
def simpson(a, b):
    h = 0.04
    n = int((4 - 0) / h)  # кількість підінтервалів
    x = [0 + i * h for i in range(n + 1)]  # вузли інтерполяції
    s = f(x[0], a, b) + f(x[n], a, b)  # додаємо крайні вузли
    
    for i in range(1, n):
        if i % 2 == 0:
            s += 2 * f(x[i], a, b)  # парні вузли
        else:
            s += 4 * f(x[i], a, b)  # непарні вузли
            
    return h / 3 * s

# Знаходимо інтеграл та похибку за правилом Рунге
I1 = simpson(1, 1.3)  # інтеграл при {a, b}={1;1.3}
I2 = simpson(1.2, 1.1)  # інтеграл при {a, b}={1.2;1.1}
I2r = I2 + (I2 - I1) / 15  # використовуємо правило Рунге
err = abs(I2r - I2)  # похибка

# Виводимо результати
print("I(1, 1.3) =", I1)
print("I(1.2, 1.1) =", I2)
print("Похибка за правилом Рунге =", err)
